{"class_name": "Functional", "config": {"name": "model_47", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_48"}, "name": "input_48", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "flatten_47", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_47", "inbound_nodes": [[["input_48", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_213", "trainable": true, "dtype": "float32", "units": 512, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_213", "inbound_nodes": [[["flatten_47", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_121", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_121", "inbound_nodes": [[["dense_213", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_214", "trainable": true, "dtype": "float32", "units": 256, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_214", "inbound_nodes": [[["dropout_121", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_122", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_122", "inbound_nodes": [[["dense_214", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_215", "trainable": true, "dtype": "float32", "units": 128, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_215", "inbound_nodes": [[["dropout_122", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_123", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_123", "inbound_nodes": [[["dense_215", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_216", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_216", "inbound_nodes": [[["dropout_123", 0, 0, {}]]]}], "input_layers": [["input_48", 0, 0]], "output_layers": [["dense_216", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}